app/Controllers/Frontend/GetStartedController.php

SELECT *
FROM `app_type`
WHERE `status` = 1
---
    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // config menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // app type
        $app_type = new AppTypeModel();
        $data['app_types'] = $app_type->where('status', 1)->get()->getResult();