app/Controllers/Frontend/GetStartedController.php

    public function index()
    {
        // config
        $configuration = new ConfigModel();
        $data['config'] = $configuration->get()->getFirstRow();
        // config menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // app type
        $app_type = new AppTypeModel();
        $data['app_types'] = $app_type->get()->getResult();
---
SELECT *
FROM `config`
SELECT *
FROM `config_menu`
SELECT *
FROM `app_type`

    public function register($id)
    {
        // config
        $configuration = new ConfigModel();
        $data['config'] = $configuration->get()->getFirstRow();
        // config menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // app
        $app = new AppModel();
        $data['apps'] = $app->orderBy('created_at', 'DESC')->get()->getResult();
---
SELECT *
FROM `config`
SELECT *
FROM `app`
ORDER BY `created_at` DESC

    public function store()
    {
        $client = new ClientModel();
        $check = $client->where('email', $this->request->getPost('email'))->get()->getFirstRow();
        if ($check) {
            session()->setFlashdata('info', 'Your email address has been registered. try use another email.');
            return redirect()->to(base_url('get-started/' . $this->request->getPost('app_id')));
        } else {
            $password = $this->request->getPost('password');
            $client->insert([
                'created_at' => date('Y-m-d H:i:s'),
                'app_id' => $this->request->getPost('app_id'),
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'phone_number' => $this->request->getPost('phone_number'),
                'password' => password_hash($password, PASSWORD_DEFAULT)
            ]);
---
SELECT *
FROM `client`
WHERE `email` = 'triratna.trs@gmdail.com'
INSERT INTO `client` (`created_at`, `app_id`, `name`, `email`, `phone_number`, `password`) VALUES ('2023-03-07 09:33:33', 'd44b7c7e-b1c8-11ed-80f6-c465162ee099', 'Dodi Novembri', 'triratna.trs@gmdail.com', '082183599197', '$2y$10$NjmNGgmR1A8KW5Znlp0/BO0Stm1Wk.L7xEbfmL.dVBpwDp8mGhDAa')