app/Controllers/Frontend/HomeController.php

SELECT *
FROM `service`
WHERE `status` = 1
SELECT *
FROM `feature`
WHERE `status` = 1
SELECT *
FROM `brand`
WHERE `status` = 1
---
    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // config menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // service
        $service = new ServiceModel();
        $data['services'] = $service->where('status', 1)->get()->getResult();
        // feature
        $feature = new FeatureModel();
        $data['features'] = $feature->where('status', 1)->get()->getResult();
        // brand
        $brand = new BrandModel();
        $data['brands'] = $brand->where('status', 1)->get()->getResult();