app/Controllers/Frontend/Homecontroller.php

SELECT *
FROM `config`
SELECT *
FROM `configuration`
SELECT *
FROM `service`
SELECT *
FROM `feature`
SELECT *
FROM `subscribe_feature`
SELECT *
FROM `brand`
SELECT *
FROM `social_media`
---
    public function index()
    {
        $configuration = new ConfigurationModel();
        $service = new ServiceModel();
        $feature = new FeatureModel();
        $subscribe_feature = new SubscribeFeatureModel();
        $brand = new BrandModel();
        $social_media = new SocialMediaModel();

        $data['config'] = $configuration->get()->getFirstRow();
        $data['services'] = $service->get()->getResult();
        $data['features'] = $feature->get()->getResult();
        $data['subscribe_features'] = $subscribe_feature->get()->getResult();
        $data['brands'] = $brand->get()->getResult();
        $data['social_medias'] = $social_media->get()->getResult();