app/Controllers/Frontend/HomeController.php

    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // config menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // service
        $service = new ServiceModel();
        $data['services'] = $service->get()->getResult();
        // feature
        $feature = new FeatureModel();
        $data['features'] = $feature->get()->getResult();
        // brand
        $brand = new BrandModel();
        $data['brands'] = $brand->get()->getResult();
---
SELECT *
FROM `config`
SELECT *
FROM `config_menu`
SELECT *
FROM `service`
SELECT *
FROM `feature`
SELECT *
FROM `brand`