app/Controllers/Frontend/Ourappscontroller.php

SELECT *
FROM `configuration`
SELECT *
FROM `config`
SELECT *
FROM `app_type`
---
    public function index()
    {
        $configuration = new ConfigurationModel();
        $app_type = new AppTypeModel();

        $data['config'] = $configuration->get()->getFirstRow();
        $data['app_types'] = $app_type->get()->getResult();

SELECT *
FROM `config`
SELECT *
FROM `app_type`
SELECT *
FROM `app`
ORDER BY `created_at` DESC
---
    public function show($code)
    {
        $configuration = new ConfigurationModel();
        $app_type = new AppTypeModel();
        $app = new AppModel();

        $data['config'] = $configuration->get()->getFirstRow();
        $data['app_types'] = $app_type->get()->getResult();
        $data['apps'] = $app->orderBy('created_at', 'DESC')->get()->getResult();