app/Controllers/Extranet/AuthController.php

SELECT *
FROM `user`
WHERE `email` = 'nadiadmin@gmail.com'
AND `role_code` = 0
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = new UserModel();
        $data = $user->where('email', $email)->where('role_code', 0)->first();