app/Controllers/Extranet/BrandController.php

    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // app type
        $brand = new BrandModel();
        $data['brands'] = $brand->get()->getResult();
---
SELECT *
FROM `config`
SELECT *
FROM `brand`

    public function show($id)
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // app type
        $brand = new BrandModel();
        $data['brand'] = $brand->where('id', $id)->get()->getFirstRow();
---
SELECT *
FROM `config`
SELECT *
FROM `brand`
WHERE `id` = '2a74e71b-bb78-11ed-9b10-b0227a7395f6'

    public function destroy($id)
    {
        $brand = new BrandModel();
        $brand->delete($id);
---
DELETE FROM `brand`
WHERE `id` IN ('2a74e71b-bb78-11ed-9b10-b0227a7395f6')