app/Controllers/Extranet/ClientController.php

    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
---
SELECT *
FROM `config`

    public function destroy($id)
    {
        $client = new ClientModel();
        $client->delete($id);
---
DELETE FROM `client`
WHERE `id` IN ('3c28544d-bc3c-11ed-afc9-b0227a7395f6')