app/Controllers/Extranet/ConfigController.php

SELECT *
FROM `config`
---
    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();