app/Controllers/Extranet/FeatureController.php

    public function show($id)
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // feature
        $feature = new FeatureModel();
        $data['feature'] = $feature->where('id', $id)->get()->getFirstRow();
---
SELECT *
FROM `config`
SELECT *
FROM `feature`
WHERE `id` = 'a1041a80-bbe8-11ed-8911-c465162ee099'

    public function edit($id)
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // feature
        $feature = new FeatureModel();
        $data['feature'] = $feature->where('id', $id)->get()->getFirstRow();
---
SELECT *
FROM `config`
SELECT *
FROM `feature`
WHERE `id` = '0995b937-9292-11ed-95d7-b0227a7395f6'