app/Controllers/Extranet/ProspectiveCustomerController.php

    public function index()
    {
        $prospective_customer = new ProspectiveCustomerModel();
        $data['prospective_customers'] = $prospective_customer->orderBy('created_at', 'ASC')->get()->getResult();
---
SELECT *
FROM `prospective_customer`
ORDER BY `created_at` ASC