app/Controllers/Extranet/ServiceController.php

SELECT *
FROM `config`
SELECT *
FROM `service`
WHERE `id` = '4cbf6043-9290-11ed-95d7-b0227a7395f6'
---
    public function show($id)
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // service
        $service = new ServiceModel();
        $data['service'] = $service->where('id', $id)->get()->getFirstRow();