app/Controllers/Extranet/TaskController.php

    public function edit($id)
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // task
        $task = new TaskModel();
        $data['task'] = $task->where('id', $id)->get()->getFirstRow();
---
SELECT *
FROM `config`
SELECT *
FROM `task`
WHERE `id` = 'aec8726d-bccb-11ed-a074-c465162ee099'

    public function destroy($id)
    {
        $task = new TaskModel();
        $task->delete($id);
---
DELETE FROM `task`
WHERE `id` IN ('32eb450f-bccc-11ed-a074-c465162ee099')